Repository: izymalhaw/Kaps
Catalog: kaps/lib/l10n/intl_*.arb
Languages: am

# helloWorld
source: hello
am: ሀሎ

# loginAccount
source: Login
am: ወደ ኣካውንቶ ይግቡ

# helloWelcome
source: Welcome to KAPS
am: እንኳን ወደ ከገበሬወ መተግበሪያ በደህና መጡ

# phone
source: Phone Number
am: ስልክ

source: password
am: ሚስጥር ቁጥር

source: SignIn
am: ይግቡ

source: SignUp
am: ይመዝገቡ

source: Logout
am: ይውጡ

source: Dashboard
am: ዳሽቦርድ

source: profile
am: የተጠቃሚ ማህደር

source: Full Name
am: ሙሉ ስም

source: My Location
am: የምገኝበት ቦታ

source: Files
am: ሰነዶች

source: Add Items
am: እቃዎችን አክል

source: History
am: ታሪክ

source: Item Details
am: የእቃ ዝርዝሮች

# chooseProduct
source: Choose Product Name
am: የምርት ስም ምረጥ

# productDesc
source: Description of Product
am: የምርት መግለጫ

source: product Quantity
am: የምርት ብዛት

source: product price
am: የምርት ዋጋ
