String text = """     የወክል/ኤጀንት ውል ስምምነት\
አንቀፅ አንድ\
የውሉ ህጋዊ ድንጋጌዎች\
1.1.	ይህ ውል በፍትሐብሔር ሕግ ቁጥር 1678/1731 እና 2005 ድንጋጌዎች መሰረት ተዋዋይ ወገኖች አውቀን፣ አምነንበትና ወደን በሙሉ ፈቃደኝነት ያደረግነውን በተወሰነው ኮሚሽን የስራው ወክል ሆኖ ለመስራት የገባን ውል ሲሆን ውሉ በእኛ በተዋዋዬች መካከል ሕግ ሆኖ ያገለግላል፡፡የውሉ ሰነድም አስተማማኝና በቂ ማስረጃችን ነው፡፡\
1.2.	ውሉ በፍትሐ ብሔር ሕግ ስለውሎች በጠቅላላው በተፃፉት ድንጋጌዎች መሰረት የተቋቋመ ውል በመሆኑ በውሉ አተረጓጎም እና አፈፃፀም ላይ እነዚህ ድንጋጌዎች ተፈፃሚነት አላቸው፡፡ \
አንቀፅ ሁለት\
የውሉ ዓላማ\
2.1.	ውል ሰጪ ለሸማቹ ማህበረሰብ የግብርና ምርቶችን በማሰባሰብና በማሰራጨት ላይ የተሻለ ተሞክሮና ለመስራት ፍላጎት ያላቸው ወክሎችን በመምረጥ እንዲሁም ዕለታዊ የሽያጭ ስራዎችን በዲጂታል መንገድ ቀጥታ በገበያዩ መጠን ኮሚሽናቸውን ለማሳደግ ከሚፈልጉ ኤጀንቶች/ወክሎች ጋር የሚደረግ የጋራ ውል ስምምነት ነው።\
አንቀፅ ሶስት\
የውል ሰጪ መብትና ግዴታ\
3.1.	ውል ሰጪው ለኤጀንቶች የሚያስረክበውን እያንዳንዱን የገበሬ ምርቶችን ወይም በወክል ለሽያጭ የቀረበውን ምርት መረጃ በአግባቡ በመያዝ አጠቃላይ ሁኔታ መዝግቦ ያስረክባል \
3.2.	ውል ሰጪው ያስቀመጠውን መሰረት በማድረግ ከገበሬው የተሰበሰበውን የግብርና ምርቶች በተዘጋጀው ፕላትፎርም መሰረት ለተቀባዮችን ያስረክባል\
3.3.	 ውል ሰጪ ለውል ተቀባይ የግብርና ምርት በሚያሳውቁበት ወቅት መሟላት ያለባቸው ቴክኖሎጂዎችን በማቅረብ ውል ተቀባዮች በቴክኖሎጂው ላይ ግንዛቤ እንዲኖራቸ ያደርጋል\
3.4.	ውል ሰጪው የግብርና ምርቶች በአየር ላይ ምን ያህል መቆየት እንዳለበት ስታንዳርድ ማውጣትና ባወጣው ስታንዳርድ መሰረት ምርቱ ገዢ ማግኘቱ በማረጋገጥ ቀጣይነት እንድሰሩ ያደርጋል \
አንቀፅ አራት\
የውል ተቀባይ መብትና ግዴታ\
4.1.	ውል ተቀባዮች በሚኖሩባቸው አካባዊዎች የግብርና ምርቶችን በ9858 ወይም በከ Kegeberew.com/በቀጥታ ዲጂታል ቴክኖሎጂን ተጠቅመው ምርቶችን በማሰባሰብ ማቅረብ፣ ገዢው ኦንላየን ምርት ግብይት ማስታወቂያ ይሰራሉ እንዲሁም በየቀኑ የግብርና ምርቶችን መረጃ ለገዢዎች እንዲያገኙ ያስደርጋሉ\
4.2.	ሁሉም ኤጀንቶች የታደሰ የቀበሊ መታወቂያ እና ለሚሰሩት ስራ ተማኝነት ሊኖራቸው ይገባል፡፡\
4.3.	የግብርና ምርቶችን ከገበሬው በማሰባስብ በቀጥታ ግብይት ውስጥ ማስገባት ያሚያስችላቸውን ቴክኖሎጂዎችን ተጠቅመው የምርት መረጃዎች ማድረስ አለባቸው\
4.4.	ያዘዙትን የግብርና ምርቶችን ለገዢዎች በሚያሰረክቡበት ጊዜ ትክክለኛነቱ ሊያረጋግጡ የሚችሉ ቴክኖሎጂዎችን እና ቀጥታ ከድርጅታችን የሚሰጠውን መረጃ መሰረት በማድረግ ምርቱን ማስረከብ አለባቸው\
4.5.	ውል ተቀባዮች የሚያሰረከቡትን የግብርና ምርት በሰበሰቡትና በተረከቡበት ብዛትና ጥራት መሰረት ምንም ሳያጎሉ ለገዢዎች ማስረከብ አለባቸው\
4.6.	በኮሚሽን ሥራ የሚሰራ ማንኛውም ኤጀንት ዋስትና ማቅረብ አለበት\
አንቀፅ አምስት\
የአከፋፈል ሁኔታ\
5.1.	 ውል ተቀባይ የግብርና ምርቶቹን ከገበሬው በማሰባሰብና በተቀመጠው ፕላትፎርሞች ላይ ምርቱን እንደተሽያጠ ኤጀንቱ/ተወካዩ በአንድ ኪ.ግራም  1% ይታሰባል፡፡\
5.2.	ክፍያው ምርቱ በግዢ አካል እንደተነሰ በቀጥታ በዲጂታል መንገድ ይፈፀማል \
አንቀፅ ስድስት\
ተጠያቂነትን በሚመለከት\
6.1.	ውል ተቀባይ የግብርና ምርቶች በሰበሰበው መሰረት ከላይ በአንቀፅ 3(5) መሰረት በተረከበው ብዛትና ጥራት ለገዢዎች ካላስረከቡ ከገንዘብ ቅጣት በተጨማሪ ውላቸው ያለምንም ተጨማሪ ክፍያ ይቋረጣል\
አንቀፅ ሰባት\
የግብር አተገባበርን በሚመለክት\
6.1.	ሁለቱም ተዋዋይ ወገኖች እንደሚመለከታቸው በህግ በተቀመጠው መሰረት የየራሳቸውን ግብር ይከፍላሉ\
አንቀፅ ስምንት\
ልዩ ልዩ ጉዳዮች\
ይህ ውል ከዚህ በታች ከተመለከቱት በአንዱ ወይም በሌሎቹ ምክንያቶች ሊቋረጥ ይችላል፡፡\
8.1.	በውል ሰጪ እና በውል ተቀባይ ስምምነት በማንኛውም ጊዜ፣\
8.2.	ከላይ በአንቀፅ 6 መሰረት ውል ተቀባዮች በተረከቡት ብዛትና ጥራት ለገዢዎች ካላስረከቡ\
8.3.	ክፍያ በውሉ መሰረት በወቅቱ ባለመክፈሉ፣\
8.4.	በኢትዮጵያ የፍትሐብሔር ሕግ ቁጥር 1793 ከአቅም በላይ ተብሎ በተገለፀው ሁኔታ መሰረት ሊቋረጥ ይችላል፡፡\
አለመግባባትን በሚመለከት\
8.5	ይህን ውል በሚመለከት በሁለቱ ተዋዋይ ወገኖች መካከል አለመግባባት ቢፈጠር በተቻለ መጠን በውይይት ለመፍታት ይሞክራሉ፡፡ ሆኖም ንብረቶችን ማጉደል ለውይይት ሊቀርብ አይችልም፡፡\
8.6	በውይይት መፍታት ካልተቻለ ጉዳዩ በኢትዮጰያ ሕግ መሰረት ተፈፃሚ ይሆናል፡፡\
 """;
